Ginger/Unit Tests/TestResources/AutoPilot/ImportOptionalValue/createPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:soap.embus.sbc.com" xmlns:urn1="urn:PamFacadePackage.pam.idl.eia.sbc.com">
   <soapenv:Header>
      <urn:MessageHeader>
         <urn:MessageTag>?</urn:MessageTag>
         <!--Optional:-->
         <urn:ApplicationID>?</urn:ApplicationID>
         <!--Optional:-->
         <urn:MessageID>?</urn:MessageID>
         <!--Optional:-->
         <urn:CorrelationID>?</urn:CorrelationID>
         <!--Optional:-->
         <urn:ConversationKey>?</urn:ConversationKey>
         <!--Optional:-->
         <urn:LoggingKey>?</urn:LoggingKey>
         <!--Optional:-->
         <urn:ResponseMessageExpiration>?</urn:ResponseMessageExpiration>
      </urn:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:com.sbc.eia.idl.pam.PamFacadePackage._createPaymentProfile5RequestBISMsg>
         <context>
      <properties>
        <item><tag field="BisContextApplication">Application</tag><value field="BisContextApplicationValue">createPaymentProfile</value></item><item><tag field="BisContextUserId">UserID</tag><value field="BisContextUserIdValue">jp901n</value></item>
      </properties>
    </context>
    <paymentProfileRequest>
      <paymentProfileItem>
        <sourceSystem>CSRTOOL</sourceSystem>
        <sourceLocation>XP</sourceLocation>
        <profileUserID>Check_CSR3</profileUserID>
        <sourceUser>ak0560</sourceUser>  
      </paymentProfileItem>
      <paymentProfileMethod>
        <check>
          <profileName>Check_CSR3</profileName>
          <checkData>
            <method>ACH</method>
            <aBARoutingTransitNumber>055001876</aBARoutingTransitNumber>
            <bankAccountNumber>0987456321</bankAccountNumber>
            <payeeName>Check_CSR3</payeeName>          
            <accountType>Checking</accountType>
            <sBusinessBankAccount>true</sBusinessBankAccount>
          </checkData>
        </check>
      </paymentProfileMethod>
    </paymentProfileRequest>
      </urn1:com.sbc.eia.idl.pam.PamFacadePackage._createPaymentProfile5RequestBISMsg>
   </soapenv:Body>
</soapenv:Envelope>